experiments/results/thesis/DPFS-URING-tmpfs-polling/fio_randwrite_64k_8_1.out
"randwrite_64k_8_1": (g=0): rw=randwrite, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=io_uring, iodepth=8
fio-3.28
Starting 1 thread

"randwrite_64k_8_1": (groupid=0, jobs=1): err= 0: pid=151144: Wed Jul 19 19:54:17 2023
  write: IOPS=31.2k, BW=1952MiB/s (2047MB/s)(114GiB/60001msec); 0 zone resets
    slat (nsec): min=4161, max=37955, avg=5644.60, stdev=506.12
    clat (usec): min=140, max=8176, avg=249.66, stdev=23.97
     lat (usec): min=146, max=8181, avg=255.38, stdev=23.97
    clat percentiles (usec):
     |  1.00th=[  196],  5.00th=[  225], 10.00th=[  231], 20.00th=[  237],
     | 30.00th=[  241], 40.00th=[  243], 50.00th=[  245], 60.00th=[  249],
     | 70.00th=[  253], 80.00th=[  262], 90.00th=[  273], 95.00th=[  289],
     | 99.00th=[  334], 99.50th=[  355], 99.90th=[  383], 99.95th=[  392],
     | 99.99th=[  441]
   bw (  MiB/s): min= 1845, max= 2033, per=100.00%, avg=1952.20, stdev=37.66, samples=120
   iops        : min=29520, max=32532, avg=31235.17, stdev=602.61, samples=120
  lat (usec)   : 250=62.12%, 500=37.87%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=7.95%, sys=20.43%, ctx=1821483, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1874043,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=1952MiB/s (2047MB/s), 1952MiB/s-1952MiB/s (2047MB/s-2047MB/s), io=114GiB (123GB), run=60001-60001msec